UCB_CS61_lec28.org
# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:python :session 第二十八课 Graph-DFS
#+PROPERTY: header-args:ipython :session 第二十八课 Graph-DFS
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
#+HTML_HEAD: <script src="https://hypothes.is/embed.js" async></script>
#+HTML_HEAD: <script type="application/json" class="js-hypothesis-config">
#+HTML_HEAD: <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: H:3 num:t ^:nil _:nil tags:not-in-toc
#+TITLE: 第二十八课 Graph-DFS
#+AUTHOR: yiddishkop
#+EMAIL: [[mailto:yiddishkop@163.com][yiddi's email]]
#+TAGS: {PKGIMPT(i) DATAVIEW(v) DATAPREP(p) GRAPHBUILD(b) GRAPHCOMPT(c)} LINAGAPI(a) PROBAPI(b) MATHFORM(f) MLALGO(m)


* GRAPHS
有很多算法都是对 DFS 的改进形成的，比如查看有无环路, find Strongly connected
components(directed Graph) DFS can identify planar graph, in time propotional to
the nodes in linear time.

* some definition

A graph G is a set V of vertices (sometimes called nodes), and a set E of edges
(sometimes called arcs) that each connect two vertices together.  To confuse
you, mathematicians often use the notation G = (V, E).  Here, "(V, E)" is an
_ordered_pair_ of sets.  This isn't as deep and meaningful as it sounds;
some people just love formalism.  The notation is convenient when you want to
discuss several graphs with the same vertices; e.g. G = (V, E) and T = (V, F).

Graphs come in two types:  _directed_ and _undirected_.  In a directed graph
(or _digraph_ for short), every edge e is directed from some vertex v to some
vertex w.  We write "e = (v, w)" (also an ordered pair), and draw an arrow
pointing from v to w.  The vertex v is called the _origin_ of e, and w is the
_destination_ of e.

digraph   = directed graph
undigraph = undirected graph

In an undirected graph, edges have no favored direction, so we draw a curve
connecting v and w.  We still write e = (v, w), but now it's an unordered pair,
which means that (v, w) = (w, v).

One application of a graph is to _model a street map_.  For each intersection,
define a vertex that represents it.  If two intersections are connected by a
length of street with no intervening intersection, define an edge connecting
them.  We might use an undirected graph, but if there are one-way streets, a
directed graph is more appropriate.  We can model a two-way street with two
edges, one pointing in each direction.  On the other hand, if we want a graph
that tells us which cities adjoin each other, an undirected graph makes sense.

#+BEGIN_EXAMPLE
     ---   Bancroft  ---             ---             --------      ------------
     |1|<------------|2|<------------|3|             |Albany|------|Kensington|
     ---             ---             ---             --------      ------------
      |               ^              | ^                     \       /
 Dana |     Telegraph |     Bowditch | |     ------------     ----------
      v               |              v |     |Emeryville|-----|Berkeley|
     ---             ---             ---     ------------     ----------
     |4|------------>|5|------------>|6|              \      /
     ---    Durant   ---             ---            ---------     ----------
                                                    |Oakland|-----|Piedmont|
Multiple copies of an edge are forbidden,           ---------     ----------
but a directed graph may contain both (v, w)
and (w, v).  Both types of graph can have _self-edges_ of the form (v, v),
which connect a vertex to itself.  (Many applications, like the two illustrated
above, don't use these.)
#+END_EXAMPLE

* adjacent matrix
  #+BEGIN_EXAMPLE
     A    K   E   B   O   P
    +---+---+---+---+---+---+
 A  | - | t |   | t |   |   |
    +---+---+---+---+---+---+
 K  | t | - |   | t |   |   |
    +---+---+---+---+---+---+
 E  |   |   | - | t | t |   |
    +---+---+---+---+---+---+
 B  | t | t | t | - | t |   |
    +---+---+---+---+---+---+
 O  |   |   | t | t | - | t |
    +---+---+---+---+---+---+
 P  |   |   |   |   | t | - |
    +---+---+---+---+---+---+
  #+END_EXAMPLE

* adjacent list
  #+BEGIN_EXAMPLE
Directed Graph: every edge occur twice;
Undirected Graph: every edge occur once;
     +---+
  A  | 0 |--->1 --->3
     +---+
  K  | 1 |--->0 --->3
     +---+
  E  | 2 |--->3 --->4
     +---+
  B  | 3 |--->0 --->1 --->2 --->4
     +---+
  O  | 4 |--->2 --->3 --->5
     +---+
  P  | 5 |--->4
     +---+
  #+END_EXAMPLE

* path vs length vs distance
A ~_path_~ is a sequence of vertices such that each adjacent pair of vertices is
connected by an edge. If the graph is directed, the edges that form the path
must all be aligned with the direction of the path.

The ~length~ of a path is the number of edges it traverses. Above, <4, 5, 6, 3>
is a path of length 3. It is perfectly respectable to talk about a path of
length zero, such as <2>.

The ~distance~ from one vertex to another is the length of the shortest path
from one to the other.

A graph is ~strongly_connected~ (in digraph)if there is a path from every vertex
to every other vertex. (This is just called ~connected~ in undirected graphs.)
Both graphs above are strongly connected.

The ~degree~ of a vertex is the number of edges incident on that vertex.
(Self-edges count just once in 61B.) Hence, Berkeley has degree 4, and Piedmont
has degree 1.

A vertex in a directed graph has an ~indegree~ (the number of edges directed
toward it) and an

~Outdegree~ (the number of edges directed away). Intersection 6 above has
indegree 2 and outdegree 1.

* planar graph
planar graph: have no edges crossing. some algo is running faster in planar
graph than regular graph. so it's important to identify a planar graph. If a
graph is not a planar, then it has one of these inside: complete 5 node graph,
and 3-3 complete graph.

