UCB_CS61_lec28.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-09 四 21:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第二十八课 Graph-DFS</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第二十八课 Graph-DFS</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge22f814">1. GRAPHS</a></li>
<li><a href="#org226c74a">2. some definition</a></li>
<li><a href="#org91e6e08">3. adjacent matrix</a></li>
<li><a href="#org4120a01">4. adjacent list</a></li>
<li><a href="#org6082cd9">5. path vs length vs distance</a></li>
<li><a href="#orgcb699ca">6. planar graph</a></li>
<li><a href="#orgb444cac">7. Toplogical Sorting</a></li>
<li><a href="#orgfd0a8aa">8. Graph Representations</a></li>
<li><a href="#orgd059987">9. choose data structure for adjacency list</a></li>
<li><a href="#org265dd0f">10. A bare skeleton of DFS</a>
<ul>
<li><a href="#org3028e60">10.1. 如果不是完全联通的图，比如有三个内部相连外部独立的图，我该怎么输出每个图的遍历结果呢？</a></li>
<li><a href="#org94e6e3a">10.2. <span class="todo TODO">TODO</span> 如何识别并找出图中的环路？</a></li>
<li><a href="#org0f1dde9">10.3. Toglogical sortting by DFS</a></li>
<li><a href="#org5f43c0e">10.4. Strongly connected</a></li>
</ul>
</li>
<li><a href="#org1ef39b6">11. Graph Traversals:DFS</a></li>
<li><a href="#orgc743b05">12. How to specify 'Cycle path' in graph</a></li>
<li><a href="#org2b2919f">13. More on the Running Time of DFS</a></li>
</ul>
</div>
</div>


<div id="orge22f814" class="outline-2">
<h2 id="orge22f814"><span class="section-number-2">1</span> GRAPHS</h2>
<div class="outline-text-2" id="text-1">
<p>
有很多算法都是对 DFS 的改进形成的，比如查看有无环路, find Strongly connected
components(directed Graph) DFS can identify planar graph, in time propotional to
the nodes in linear time.
</p>
</div>
</div>

<div id="org226c74a" class="outline-2">
<h2 id="org226c74a"><span class="section-number-2">2</span> some definition</h2>
<div class="outline-text-2" id="text-2">
<p>
A graph G is a set V of vertices (sometimes called nodes), and a set E of edges
(sometimes called arcs) that each connect two vertices together.  To confuse
you, mathematicians often use the notation G = (V, E).  Here, "(V, E)" is an
<span class="underline">ordered_pair</span> of sets.  This isn't as deep and meaningful as it sounds;
some people just love formalism.  The notation is convenient when you want to
discuss several graphs with the same vertices; e.g. G = (V, E) and T = (V, F).
</p>

<p>
Graphs come in two types:  <span class="underline">directed</span> and <span class="underline">undirected</span>.  In a directed graph
(or <span class="underline">digraph</span> for short), every edge e is directed from some vertex v to some
vertex w.  We write "e = (v, w)" (also an ordered pair), and draw an arrow
pointing from v to w.  The vertex v is called the <span class="underline">origin</span> of e, and w is the
<span class="underline">destination</span> of e.
</p>

<p>
digraph   = directed graph
undigraph = undirected graph
</p>

<p>
In an undirected graph, edges have no favored direction, so we draw a curve
connecting v and w.  We still write e = (v, w), but now it's an unordered pair,
which means that (v, w) = (w, v).
</p>

<p>
One application of a graph is to <span class="underline">model a street map</span>.  For each intersection,
define a vertex that represents it.  If two intersections are connected by a
length of street with no intervening intersection, define an edge connecting
them.  We might use an undirected graph, but if there are one-way streets, a
directed graph is more appropriate.  We can model a two-way street with two
edges, one pointing in each direction.  On the other hand, if we want a graph
that tells us which cities adjoin each other, an undirected graph makes sense.
</p>

<pre class="example">
     ---   Bancroft  ---             ---             --------      ------------
     |1|&lt;------------|2|&lt;------------|3|             |Albany|------|Kensington|
     ---             ---             ---             --------      ------------
      |               ^              | ^                     \       /
 Dana |     Telegraph |     Bowditch | |     ------------     ----------
      v               |              v |     |Emeryville|-----|Berkeley|
     ---             ---             ---     ------------     ----------
     |4|------------&gt;|5|------------&gt;|6|              \      /
     ---    Durant   ---             ---            ---------     ----------
                                                    |Oakland|-----|Piedmont|
Multiple copies of an edge are forbidden,           ---------     ----------
but a directed graph may contain both (v, w)
and (w, v).  Both types of graph can have _self-edges_ of the form (v, v),
which connect a vertex to itself.  (Many applications, like the two illustrated
above, don't use these.)
</pre>
</div>
</div>

<div id="org91e6e08" class="outline-2">
<h2 id="org91e6e08"><span class="section-number-2">3</span> adjacent matrix</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
    A    K   E   B   O   P
   +---+---+---+---+---+---+
A  | - | t |   | t |   |   |
   +---+---+---+---+---+---+
K  | t | - |   | t |   |   |
   +---+---+---+---+---+---+
E  |   |   | - | t | t |   |
   +---+---+---+---+---+---+
B  | t | t | t | - | t |   |
   +---+---+---+---+---+---+
O  |   |   | t | t | - | t |
   +---+---+---+---+---+---+
P  |   |   |   |   | t | - |
   +---+---+---+---+---+---+
</pre>
</div>
</div>

<div id="org4120a01" class="outline-2">
<h2 id="org4120a01"><span class="section-number-2">4</span> adjacent list</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
Directed Graph: every edge occur twice;
Undirected Graph: every edge occur once;
     +---+
  A  | 0 |---&gt;1 ---&gt;3
     +---+
  K  | 1 |---&gt;0 ---&gt;3
     +---+
  E  | 2 |---&gt;3 ---&gt;4
     +---+
  B  | 3 |---&gt;0 ---&gt;1 ---&gt;2 ---&gt;4
     +---+
  O  | 4 |---&gt;2 ---&gt;3 ---&gt;5
     +---+
  P  | 5 |---&gt;4
     +---+
</pre>
</div>
</div>

<div id="org6082cd9" class="outline-2">
<h2 id="org6082cd9"><span class="section-number-2">5</span> path vs length vs distance</h2>
<div class="outline-text-2" id="text-5">
<p>
A <code>_path_</code> is a sequence of vertices such that each adjacent pair of vertices is
connected by an edge. If the graph is directed, the edges that form the path
must all be aligned with the direction of the path.
</p>

<p>
The <code>length</code> of a path is the number of edges it traverses. Above, &lt;4, 5, 6, 3&gt;
is a path of length 3. It is perfectly respectable to talk about a path of
length zero, such as &lt;2&gt;.
</p>

<p>
The <code>distance</code> from one vertex to another is the length of the shortest path
from one to the other.
</p>

<p>
A graph is <code>strongly_connected</code> (in digraph)if there is a path from every vertex
to every other vertex. (This is just called <code>connected</code> in undirected graphs.)
Both graphs above are strongly connected.
</p>

<p>
The <code>degree</code> of a vertex is the number of edges incident on that vertex.
(Self-edges count just once in 61B.) Hence, Berkeley has degree 4, and Piedmont
has degree 1.
</p>

<p>
A vertex in a directed graph has an <code>indegree</code> (the number of edges directed
toward it) and an
</p>

<p>
<code>Outdegree</code> (the number of edges directed away). Intersection 6 above has
indegree 2 and outdegree 1.
</p>
</div>
</div>

<div id="orgcb699ca" class="outline-2">
<h2 id="orgcb699ca"><span class="section-number-2">6</span> planar graph</h2>
<div class="outline-text-2" id="text-6">
<p>
planar graph: have no edges crossing. some algo is running faster in planar
graph than regular graph. so it's important to identify a planar graph. If a
graph is not a planar, then it has one of these inside: complete 5 node graph,
and 3-3 complete graph.
</p>
</div>
</div>
