UCB_CS61_lec28.org
* Toplogical Sorting
教授说，任何一个算法都不能脱离数据结构，

当你使用一个算法的时候，最好根据具体问题，事先制定好自己所使用的数据结构，然后再
在数据结构基础上定义 api.最后实现算法。

数据结构是存储和操作数据的工具;

算法是操作工具的步骤;

需要注意的是算法的本质和核心就是步骤，一般要么是循环，要么是递归，所以 应该让算法做的操作尽可能的少;

什么意思，就是在数据结构阶段，多做一些预处理，多把一些食物咀嚼碎放在勺子里等待算
法去取。

#+BEGIN_EXAMPLE
     +---+                                +---+
  A  | 0 |--->1 --->3                  A  | 0 |--->1 --->3--->4--->5--->2---->0
     +---+                                +---+
  K  | 1 |--->0 --->3                  K  | 1 |
     +---+                                +---+
  E  | 2 |--->3 --->4                  E  | 2 |
     +---+                                +---+
  B  | 3 |--->0 --->1 --->2 --->4      B  | 3 |
     +---+                                +---+
  O  | 4 |--->2 --->3 --->5            O  | 4 |
     +---+                                +---+
  P  | 5 |--->4                        P  | 5 |
     +---+                                +---+

#+END_EXAMPLE

注意，为什么 graph 算法复杂度中经常出现 n（节点数量），因为对于有向图如果所有边
都连接 A，而其他节点都没有边，那么根据算法检查 A 之后你还需要依次检查其余所有节
点，所以最差复杂度会包含 n 个节点,但实际上他们并没有边连接。如果有边连接那就直接
算在边里算一次就好了，没有边连接所以需要加上节点数量。

Toplogical sorting 开始
#+BEGIN_EXAMPLE
      A------>B ------>C--------+
      +---\   ^        |        |
           \  |        |        |
        /---\-+        |        |
       /     v         V        V
      O------>C------->E------->F
                                   Indegree                                  queue: ->
+---+                                 +---+---+                          _________________
| A |--->B--->C                       | 0 | A |--->B--->C                      C B +O+ +A+
+---+                                 +---+---+                          -----------------
| B |--->D                            | 2 | B |--->D
+---+                                 +---+---+
| C |--->E                            | 2 | C |--->E
+---+                                 +---+---+
| D |--->E--->F                       | 1 | D |--->E--->F
+---+                                 +---+---+
| E |--->F                            | 2 | E |--->F
+---+                                 +---+---+
| F |                                 | 2 | F |
+---+                                 +---+---+
| O |--->B--->C                       | 0 | O |--->B--->C
+---+                                 +---+---+

#+END_EXAMPLE

~*DAG*~: directed a cyclic graph.which means if a grpah has a cycle it's not
toplogical ordering graph.

Only make sense when the graph is Directed.
1. ~O(n+e)~: find all nodes that have no arrows going into them --- ~in-degree =
   0~
2. delete them, ouput them. repeat step 1. until graph is empty.

这个算法的复杂度基本是： ~O(n*(n+e))~

*Improvement-1:*

在数据结构阶段多做一些，多咀嚼一些数据给算法。增加一列存放每个 node 的
in-degree. 并不直接操作后面的 adjacent list。算法仅仅操作 indegree 这一列：遍历
indegree=0 的 node，凡出现者，in-degree --;但是，你没法区分新出现的 0,和早就已经
是 0 的节点。毕竟你不想重复遍历之前已经为 0 的那些节点了。

*Improvement-2:*

我们需要能保证某种顺序的结构---queue.把每次检索到的 inDegree=0 的节点 enqueue();
dequeue()一个，遍历连接 nodes，凡所出现，indegree--, 如果某个 indegree--之后为
0,直接 enqueue. 当 queue is empty, algorithms done!

算法复杂度仅仅是：你 enqueue() 了 n 个节点，每个节点的连接检测一次 e，so, O(n+e)
or approximate O(e)

* Graph Representations
There are two popular ways to represent a graph.  The first is an _adjacency_
_matrix_, a |V|-by-|V| array of boolean values (where |V| is the number of
vertices in the graph).  Each row and column represents a vertex of the graph.
Set the value at row i, column j to true if (i, j) is an edge of the graph.  If
the graph is undirected (below right), the adjacency matrix is _symmetric_:
row i, column j has the same value as row j, column i.

#+BEGIN_EXAMPLE
          1 2 3 4 5 6                           Alb Ken Eme Ber Oak Pie
        1 - - - T - -                    Albany  -   T   -   T   -   -
        2 T - - - - -                Kensington  T   -   -   T   -   -
        3 - T - - - T                Emeryville  -   -   -   T   T   -
        4 - - - - T -                  Berkeley  T   T   T   -   T   -
        5 - T - - - T                   Oakland  -   -   T   T   -   T
        6 - - T - - -                  Piedmont  -   -   -   -   T   -

        这个有向图，                             由于这个图是对称矩阵，
        row --> cloumn                         所以也可以只存储：对角线+上半 或 对角线+下半

#+END_EXAMPLE

It should be clear that the maximum possible number of edges is |V|^2 for a
directed graph, and slightly more than(上图中因为包含对角线所以是 slightly more
than ) half that for an undirected graph.

In many applications, however, the number of edges is much less than
Theta(|V|^2). For instance, our maps above are _planar_graphs_ (graphs that can
be drawn without edges crossing), and all planar graphs have O(|V|) edges. A
graph is called _sparse_ if it has far fewer edges than the maximum possible
number. ("Sparse" has no precise definition, but it usually implies that the
number of edges is asymptotically smaller than |V|^2.)

For a sparse graph, an adjacency matrix representation is very wasteful.
A more memory-efficient data structure for sparse graphs is the _adjacency_
_list_.  An adjacency list is actually a collection of lists.  Each vertex v
maintains a list of the edges directed out from v.  The standard list
representations all work--arrays (below left), linked lists (below right), even
search trees (because you can traverse one in linear time).

#+BEGIN_EXAMPLE
      ---   -----                       ---   ------   ------
    1 |.+-> | 4 |                Albany |.+-> |Ken.+-> |Ber*|
      ---   =====                       ===   ======   ======
    2 |.+-> | 1 |            Kensington |.+-> |Alb.+-> |Ber*|
      ---   =====----                   ===   ======   ======
    3 |.+-> | 2 | 6 |        Emeryville |.+-> |Ber.+-> |Oak*|
      ---   =====----                   ===   ======   ======   ------   ------
    4 |.+-> | 5 |              Berkeley |.+-> |Alb.+-> |Ken.+-> |Eme.+-> |Oak*|
      ---   =====----                   ===   ======   ======   ======   ------
    5 |.+-> | 2 | 6 |           Oakland |.+-> |Eme.+-> |Ber.+-> |Pie*|
      ---   =====----                   ===   ======   ------   ------
    6 |.+-> | 3 |              Piedmont |.+-> |Oak*|
      ---   -----                       ---   ------
#+END_EXAMPLE

The total memory used by all the lists is Theta(|V| + |E|).

* choose data structure for adjacency list
If your vertices have consecutive integer names, you can declare an array of
lists, and find any vertex's list in O(1) time.
index-> key(num); value-> list of vertices

If your vertices have names like "Albany," you can use a hash table to map names
to lists. Each entry in the hash table uses a vertex name as a key, and a List
object as the associated value. You can find the list for any label in O(1) average time.
key-> vertex name; value-> list of vertices

An adjacency list is more space- and time-efficient than an adjacency matrix
for a _sparse graph_, but less efficient for a _complete_graph_.  A complete
graph is a graph having every possible edge; that is, for every vertex u and
every vertex v, (u, v) is an edge of the graph.

同理如果是满载矩阵，而且 verex 都是字符串，该怎么办呢？

先用 hash table 对字符串做映射：string -> ints. 然后 再用数字作为矩阵的行列来存
储在二维数组中。


