UCB_CS61_lec28.html

<div id="orgb444cac" class="outline-2">
<h2 id="orgb444cac"><span class="section-number-2">7</span> Toplogical Sorting</h2>
<div class="outline-text-2" id="text-7">
<p>
教授说，任何一个算法都不能脱离数据结构，
</p>

<p>
当你使用一个算法的时候，最好根据具体问题，事先制定好自己所使用的数据结构，然后再在数据结构基础上定义 api.最后实现算法。
</p>

<p>
数据结构是存储和操作数据的工具;
</p>

<p>
算法是操作工具的步骤;
</p>

<p>
需要注意的是算法的本质和核心就是步骤，一般要么是循环，要么是递归，所以 应该让算法做的操作尽可能的少;
</p>

<p>
什么意思，就是在数据结构阶段，多做一些预处理，多把一些食物咀嚼碎放在勺子里等待算法去取。
</p>

<pre class="example">
   +---+                                +---+
A  | 0 |---&gt;1 ---&gt;3                  A  | 0 |---&gt;1 ---&gt;3---&gt;4---&gt;5---&gt;2----&gt;0
   +---+                                +---+
K  | 1 |---&gt;0 ---&gt;3                  K  | 1 |
   +---+                                +---+
E  | 2 |---&gt;3 ---&gt;4                  E  | 2 |
   +---+                                +---+
B  | 3 |---&gt;0 ---&gt;1 ---&gt;2 ---&gt;4      B  | 3 |
   +---+                                +---+
O  | 4 |---&gt;2 ---&gt;3 ---&gt;5            O  | 4 |
   +---+                                +---+
P  | 5 |---&gt;4                        P  | 5 |
   +---+                                +---+

</pre>

<p>
注意，为什么 graph 算法复杂度中经常出现 n（节点数量），因为对于有向图如果所有边都连接 A，而其他节点都没有边，那么根据算法检查 A 之后你还需要依次检查其余所有节点，所以最差复杂度会包含 n 个节点,但实际上他们并没有边连接。如果有边连接那就直接算在边里算一次就好了，没有边连接所以需要加上节点数量。
</p>

<p>
Toplogical sorting 开始
</p>
<pre class="example">
      A------&gt;B ------&gt;C--------+
      +---\   ^        |        |
           \  |        |        |
        /---\-+        |        |
       /     v         V        V
      O------&gt;C-------&gt;E-------&gt;F
                                   Indegree                                  queue: -&gt;
+---+                                 +---+---+                          _________________
| A |---&gt;B---&gt;C                       | 0 | A |---&gt;B---&gt;C                      C B +O+ +A+
+---+                                 +---+---+                          -----------------
| B |---&gt;D                            | 2 | B |---&gt;D
+---+                                 +---+---+
| C |---&gt;E                            | 2 | C |---&gt;E
+---+                                 +---+---+
| D |---&gt;E---&gt;F                       | 1 | D |---&gt;E---&gt;F
+---+                                 +---+---+
| E |---&gt;F                            | 2 | E |---&gt;F
+---+                                 +---+---+
| F |                                 | 2 | F |
+---+                                 +---+---+
| O |---&gt;B---&gt;C                       | 0 | O |---&gt;B---&gt;C
+---+                                 +---+---+

</pre>

<p>
<code>*DAG*</code>: directed a cyclic graph.which means if a grpah has a cycle it's not
toplogical ordering graph.
</p>

<p>
Only make sense when the graph is Directed.
</p>
<ol class="org-ol">
<li><code>O(n+e)</code>: find all nodes that have no arrows going into them &#x2014; <code>in-degree =
   0</code></li>
<li>delete them, ouput them. repeat step 1. until graph is empty.</li>
</ol>

<p>
这个算法的复杂度基本是： <code>O(n*(n+e))</code>
</p>

<p>
<b>Improvement-1:</b>
</p>

<p>
在数据结构阶段多做一些，多咀嚼一些数据给算法。增加一列存放每个 node 的
in-degree. 并不直接操作后面的 adjacent list。算法仅仅操作 indegree 这一列：遍历
indegree=0 的 node，凡出现者，in-degree &#x2013;;但是，你没法区分新出现的 0,和早就已经是 0 的节点。毕竟你不想重复遍历之前已经为 0 的那些节点了。
</p>

<p>
<b>Improvement-2:</b>
</p>

<p>
我们需要能保证某种顺序的结构&#x2014;queue.把每次检索到的 inDegree=0 的节点 enqueue();
dequeue()一个，遍历连接 nodes，凡所出现，indegree&#x2013;, 如果某个 indegree&#x2013;之后为
0,直接 enqueue. 当 queue is empty, algorithms done!
</p>

<p>
算法复杂度仅仅是：你 enqueue() 了 n 个节点，每个节点的连接检测一次 e，so, O(n+e)
or approximate O(e)
</p>
</div>
</div>

<div id="orgfd0a8aa" class="outline-2">
<h2 id="orgfd0a8aa"><span class="section-number-2">8</span> Graph Representations</h2>
<div class="outline-text-2" id="text-8">
<p>
There are two popular ways to represent a graph.  The first is an <span class="underline">adjacency</span>
<span class="underline">matrix</span>, a |V|-by-|V| array of boolean values (where |V| is the number of
vertices in the graph).  Each row and column represents a vertex of the graph.
Set the value at row i, column j to true if (i, j) is an edge of the graph.  If
the graph is undirected (below right), the adjacency matrix is <span class="underline">symmetric</span>:
row i, column j has the same value as row j, column i.
</p>

<pre class="example">
  1 2 3 4 5 6                           Alb Ken Eme Ber Oak Pie
1 - - - T - -                    Albany  -   T   -   T   -   -
2 T - - - - -                Kensington  T   -   -   T   -   -
3 - T - - - T                Emeryville  -   -   -   T   T   -
4 - - - - T -                  Berkeley  T   T   T   -   T   -
5 - T - - - T                   Oakland  -   -   T   T   -   T
6 - - T - - -                  Piedmont  -   -   -   -   T   -

这个有向图，                             由于这个图是对称矩阵，
row --&gt; cloumn                         所以也可以只存储：对角线+上半 或 对角线+下半

</pre>

<p>
It should be clear that the maximum possible number of edges is |V|^2 for a
directed graph, and slightly more than(上图中因为包含对角线所以是 slightly more
than ) half that for an undirected graph.
</p>

<p>
In many applications, however, the number of edges is much less than
Theta(|V|^2). For instance, our maps above are <span class="underline">planar_graphs</span> (graphs that can
be drawn without edges crossing), and all planar graphs have O(|V|) edges. A
graph is called <span class="underline">sparse</span> if it has far fewer edges than the maximum possible
number. ("Sparse" has no precise definition, but it usually implies that the
number of edges is asymptotically smaller than |V|^2.)
</p>

<p>
For a sparse graph, an adjacency matrix representation is very wasteful.
A more memory-efficient data structure for sparse graphs is the <span class="underline">adjacency</span>
<span class="underline">list</span>.  An adjacency list is actually a collection of lists.  Each vertex v
maintains a list of the edges directed out from v.  The standard list
representations all work&#x2013;arrays (below left), linked lists (below right), even
search trees (because you can traverse one in linear time).
</p>

<pre class="example">
  ---   -----                       ---   ------   ------
1 |.+-&gt; | 4 |                Albany |.+-&gt; |Ken.+-&gt; |Ber*|
  ---   =====                       ===   ======   ======
2 |.+-&gt; | 1 |            Kensington |.+-&gt; |Alb.+-&gt; |Ber*|
  ---   =====----                   ===   ======   ======
3 |.+-&gt; | 2 | 6 |        Emeryville |.+-&gt; |Ber.+-&gt; |Oak*|
  ---   =====----                   ===   ======   ======   ------   ------
4 |.+-&gt; | 5 |              Berkeley |.+-&gt; |Alb.+-&gt; |Ken.+-&gt; |Eme.+-&gt; |Oak*|
  ---   =====----                   ===   ======   ======   ======   ------
5 |.+-&gt; | 2 | 6 |           Oakland |.+-&gt; |Eme.+-&gt; |Ber.+-&gt; |Pie*|
  ---   =====----                   ===   ======   ------   ------
6 |.+-&gt; | 3 |              Piedmont |.+-&gt; |Oak*|
  ---   -----                       ---   ------
</pre>

<p>
The total memory used by all the lists is Theta(|V| + |E|).
</p>
</div>
</div>

<div id="orgd059987" class="outline-2">
<h2 id="orgd059987"><span class="section-number-2">9</span> choose data structure for adjacency list</h2>
<div class="outline-text-2" id="text-9">
<p>
If your vertices have consecutive integer names, you can declare an array of
lists, and find any vertex's list in O(1) time.
index-&gt; key(num); value-&gt; list of vertices
</p>

<p>
If your vertices have names like "Albany," you can use a hash table to map names
to lists. Each entry in the hash table uses a vertex name as a key, and a List
object as the associated value. You can find the list for any label in O(1) average time.
key-&gt; vertex name; value-&gt; list of vertices
</p>

<p>
An adjacency list is more space- and time-efficient than an adjacency matrix
for a <span class="underline">sparse graph</span>, but less efficient for a <span class="underline">complete_graph</span>.  A complete
graph is a graph having every possible edge; that is, for every vertex u and
every vertex v, (u, v) is an edge of the graph.
</p>

<p>
同理如果是满载矩阵，而且 verex 都是字符串，该怎么办呢？
</p>

<p>
先用 hash table 对字符串做映射：string -&gt; ints. 然后 再用数字作为矩阵的行列来存储在二维数组中。
</p>
</div>
</div>
