UCB_CS61_lec28.org
* A bare skeleton of DFS

#+NAME: skeleton of GFS
#+BEGIN_SRC java
// DFS 某个独立的图伪代码
1. DFS(randomly choose i)
2. mark(i);
@. <Input some code here 1>
4. for all j adjacent to i, if j is unmarked:
@.      <Input some code here 2>
5.      DFS(j);
@.      <Input some code here 3>
@. <Input some code here 4>
// 对于包含多个非联通的独立子图的图
1. For i = 1 to n, if i is unmarked:
@.      <Input some code here 1>
2.      DFS(i)
@.      <Input some code here 2>
@. <Input some code here 3>

#+END_SRC
通过在 skeleton 中不同位置添加不同代码来实现不同的功能：大图中包含独立小图，图中
环路，toplogical sorting,strongly connected

** 如果不是完全联通的图，比如有三个内部相连外部独立的图，我该怎么输出每个图的遍历结果呢？
1. 设置外循环，去遍历每一个节点执行 dfs(i)，而不是只 dfs()一个节点
2. 对每一个内部递归去 stack 某个点，并在本次循环执行完毕之后 empty and output
   the stack,最好设置 count 变量保存这个独立的图的是第几个。
#+NAME: algo for several separte GFS
#+BEGIN_SRC java
// DFS 某个独立的图伪代码
1. DFS(randomly choose i)
2. mark(i);
@. <Input some code here 1>: add i to statck
4. for all j adjacent to i, if j is unmarked:
@.      <Input some code here 2>
5.      DFS(j);
@.      <Input some code here 3>
@. <Input some code here 4>
// 对于包含多个非联通的独立子图的图
1. For i = 1 to n, if i is unmarked:
@.      <Input some code here 1>
2.      DFS(i)
@.      <Input some code here 2>: print and empty elements in stack
@. <Input some code here 3>
#+END_SRC

** TODO 如何识别并找出图中的环路？
要识别环路就要区分几种边： ~forward edge, backward edge, cross edge, tree edge~.
tree edge: 就是真正 visited 的路径; backward edge:TODO

#+BEGIN_SRC java
// DFS 某个独立的图伪代码
1. DFS(randomly choose i)
2. mark(i);
@. <Input some code here 1>
4. for all j adjacent to i, if j is unmarked:
@.      <Input some code here 2>: parent(j) = i
5.      DFS(j);
@.      <Input some code here 3>
@. <Input some code here 4>
// 对于包含多个非联通的独立子图的图
1. For i = 1 to n, if i is unmarked:
@.      <Input some code here 1>
2.      DFS(i)
@.      <Input some code here 2>
@. <Input some code here 3>

#+END_SRC

** Toglogical sortting by DFS
这是一种比之前使用的方法更好的解决 toplogical sortting 更好的方法。可以通过记录
每一个你遍历过的节点，然后反向输出即可得到这个 toplogical sortting

