UCB_CS61_lec28.html


<div id="org265dd0f" class="outline-2">
<h2 id="org265dd0f"><span class="section-number-2">10</span> A bare skeleton of DFS</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-java" id="org1e8018a"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">DFS &#26576;&#20010;&#29420;&#31435;&#30340;&#22270;&#20266;&#20195;&#30721;</span>
<span style="color: #a45bad;">1</span>. DFS(randomly <span style="color: #ce537a; font-weight: bold;">choose</span> <span style="color: #7590db;">i</span>)
<span style="color: #a45bad;">2</span>. mark(i);
@. &lt;Input some code here <span style="color: #a45bad;">1</span>&gt;
<span style="color: #a45bad;">4</span>. <span style="color: #4f97d7; font-weight: bold;">for</span> all j adjacent to i, <span style="color: #4f97d7; font-weight: bold;">if</span> j is unmarked:
@.      &lt;Input some code here <span style="color: #a45bad;">2</span>&gt;
<span style="color: #a45bad;">5</span>.      DFS(j);
@.      &lt;Input some code here <span style="color: #a45bad;">3</span>&gt;
@. &lt;Input some code here <span style="color: #a45bad;">4</span>&gt;
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#23545;&#20110;&#21253;&#21547;&#22810;&#20010;&#38750;&#32852;&#36890;&#30340;&#29420;&#31435;&#23376;&#22270;&#30340;&#22270;</span>
<span style="color: #a45bad;">1</span>. For i = <span style="color: #a45bad;">1</span> to n, <span style="color: #4f97d7; font-weight: bold;">if</span> i is unmarked:
@.      &lt;Input some code here <span style="color: #a45bad;">1</span>&gt;
<span style="color: #a45bad;">2</span>.      DFS(i)
@.      &lt;Input some code here <span style="color: #a45bad;">2</span>&gt;
@. &lt;Input some code here <span style="color: #a45bad;">3</span>&gt;

</pre>
</div>
<p>
通过在 skeleton 中不同位置添加不同代码来实现不同的功能：大图中包含独立小图，图中环路，toplogical sorting,strongly connected
</p>
</div>

<div id="org3028e60" class="outline-3">
<h3 id="org3028e60"><span class="section-number-3">10.1</span> 如果不是完全联通的图，比如有三个内部相连外部独立的图，我该怎么输出每个图的遍历结果呢？</h3>
<div class="outline-text-3" id="text-10-1">
<ol class="org-ol">
<li>设置外循环，去遍历每一个节点执行 dfs(i)，而不是只 dfs()一个节点</li>
<li>对每一个内部递归去 stack 某个点，并在本次循环执行完毕之后 empty and output
the stack,最好设置 count 变量保存这个独立的图的是第几个。</li>
</ol>
<div class="org-src-container">
<pre class="src src-java" id="orge61753c"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">DFS &#26576;&#20010;&#29420;&#31435;&#30340;&#22270;&#20266;&#20195;&#30721;</span>
<span style="color: #a45bad;">1</span>. DFS(randomly <span style="color: #ce537a; font-weight: bold;">choose</span> <span style="color: #7590db;">i</span>)
<span style="color: #a45bad;">2</span>. mark(i);
@. &lt;Input some code here <span style="color: #a45bad;">1</span>&gt;: add i to statck
<span style="color: #a45bad;">4</span>. <span style="color: #4f97d7; font-weight: bold;">for</span> all j adjacent to i, <span style="color: #4f97d7; font-weight: bold;">if</span> j is unmarked:
@.      &lt;Input some code here <span style="color: #a45bad;">2</span>&gt;
<span style="color: #a45bad;">5</span>.      DFS(j);
@.      &lt;Input some code here <span style="color: #a45bad;">3</span>&gt;
@. &lt;Input some code here <span style="color: #a45bad;">4</span>&gt;
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#23545;&#20110;&#21253;&#21547;&#22810;&#20010;&#38750;&#32852;&#36890;&#30340;&#29420;&#31435;&#23376;&#22270;&#30340;&#22270;</span>
<span style="color: #a45bad;">1</span>. For i = <span style="color: #a45bad;">1</span> to n, <span style="color: #4f97d7; font-weight: bold;">if</span> i is unmarked:
@.      &lt;Input some code here <span style="color: #a45bad;">1</span>&gt;
<span style="color: #a45bad;">2</span>.      DFS(i)
@.      &lt;Input some code here <span style="color: #a45bad;">2</span>&gt;: print and empty elements in stack
@. &lt;Input some code here <span style="color: #a45bad;">3</span>&gt;
</pre>
</div>
</div>
</div>

<div id="org94e6e3a" class="outline-3">
<h3 id="org94e6e3a"><span class="section-number-3">10.2</span> <span class="todo TODO">TODO</span> 如何识别并找出图中的环路？</h3>
<div class="outline-text-3" id="text-10-2">
<p>
要识别环路就要区分几种边： <code>forward edge, backward edge, cross edge, tree edge</code>.
tree edge: 就是真正 visited 的路径; backward edge:TODO
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">DFS &#26576;&#20010;&#29420;&#31435;&#30340;&#22270;&#20266;&#20195;&#30721;</span>
<span style="color: #a45bad;">1</span>. DFS(randomly <span style="color: #ce537a; font-weight: bold;">choose</span> <span style="color: #7590db;">i</span>)
<span style="color: #a45bad;">2</span>. mark(i);
@. &lt;Input some code here <span style="color: #a45bad;">1</span>&gt;
<span style="color: #a45bad;">4</span>. <span style="color: #4f97d7; font-weight: bold;">for</span> all j adjacent to i, <span style="color: #4f97d7; font-weight: bold;">if</span> j is unmarked:
@.      &lt;Input some code here <span style="color: #a45bad;">2</span>&gt;: parent(j) = i
<span style="color: #a45bad;">5</span>.      DFS(j);
@.      &lt;Input some code here <span style="color: #a45bad;">3</span>&gt;
@. &lt;Input some code here <span style="color: #a45bad;">4</span>&gt;
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#23545;&#20110;&#21253;&#21547;&#22810;&#20010;&#38750;&#32852;&#36890;&#30340;&#29420;&#31435;&#23376;&#22270;&#30340;&#22270;</span>
<span style="color: #a45bad;">1</span>. For i = <span style="color: #a45bad;">1</span> to n, <span style="color: #4f97d7; font-weight: bold;">if</span> i is unmarked:
@.      &lt;Input some code here <span style="color: #a45bad;">1</span>&gt;
<span style="color: #a45bad;">2</span>.      DFS(i)
@.      &lt;Input some code here <span style="color: #a45bad;">2</span>&gt;
@. &lt;Input some code here <span style="color: #a45bad;">3</span>&gt;

</pre>
</div>
</div>
</div>

<div id="org0f1dde9" class="outline-3">
<h3 id="org0f1dde9"><span class="section-number-3">10.3</span> Toglogical sortting by DFS</h3>
<div class="outline-text-3" id="text-10-3">
<p>
这是一种比之前使用的方法更好的解决 toplogical sortting 更好的方法。可以通过记录每一个你遍历过的节点，然后反向输出即可得到这个 toplogical sortting
</p>
</div>
</div>
