UCB_CS61_lec28.org
** Strongly connected
Strongly connected graph 是指图中任何一点都可以到达其他点的有向图。
有很多算法都是建构在 stongly connected graph 的基础之上，所以识别
这个属性非常重要

#+BEGIN_EXAMPLE
      ................         ..............
      .   *------->*-.---------.>*<-------* .
      .    ^      / \.         .  \      ^  .
      .     \    /   .+--\     .   \    /   .
      .      \  /    .    \    .    \  /    .
      .       \v     .     v   .     v/     .
      .        *     .      *--.---->*      .
      ................      |  ..............
               |            |         |
               |            |         |
               |            |         |
               |            |         |
               |            |         |
               |            |         |
               |            |         |
       +---------------------------------------+
       |   3 strongly     connected components |
       +---------------------------------------+

#+END_EXAMPLE
every directed graph can be split up into an equivalence class of strongly
connected components. These 3 are considered equivalence class of strongly
connected.

这对于你求有很多独立有向小图的大图的 minimum spanning tree 也很有作用，你首先就
需要得到这么多小图这里‘独立’就是指是否 strongly connected，‘连接而不独立’ 就
是指 connected but not strongly connected. 相当于连接性整体上升了一个档次。

#+NAME: algo for identifing strongly connected graph
#+BEGIN_EXAMPLE
1. DFS search and calculat finishing times of each node
   1. one for finishing times useful, algo for topological sort
   2. finishing times of a DFS give us in reverse the topological sort
2. reverse the edges in graph
3. call DFS on the nodes in the reverse graph, in reverse order of the finishing times

#+END_EXAMPLE

#+BEGIN_EXAMPLE
Original graph:
          a------->b------>c<------d
           ^      / \       \      ^
            \    /   \       \    /
             \  /     \       \  /
              \v       v       v/
               e        f----->g

DFS and caculate finishing times:
                   6       3       1
        7 a------->b------>c<------d
           ^      / \       \      ^
            \    /   \       \    /
             \  /     \       \  /
              \v       v       v/
               e        f----->g
               4        5      2

Reverse edges:
          a<-------b<------c------<d
           \      ^ ^       ^      /
            \    /   \       \    /
             \  /     \       \  /
              v/       \       \v
               e        f<-----g

#+END_EXAMPLE

Call DFS on nodes in reverse graph, in reverse order of finishing times
#+BEGIN_EXAMPLE
         (1)                         (2)
a<-------b<------c------<d   a<-------b<------c------<d
.\      ^ ^       ^      /   .\      ^.^       ^      /
 .\    /   \       \    /     .\    /.  \       \    /
  .\  /     \       \  /       .\  /.    \       \  /
   .v/       \       \v         .v/.      \       \v
     e        f<-----g            e        f<-----g

        (3)                          (4)                         (5)
                                               .......                     .......
a<-------b<------c------<d   a<-------b<------c------<d  a<-------b<------c------<d
.\      ^.^       ^      /   .\      ^.^       ^      /  .\      ^.^       ^      /.
 .\    /.  \       \    /     .\    /.  \       \    /    .\    /.  \       \    /.
  .\  /.    \       \  /       .\  /.    \       \  /      .\  /.    \       \  /.
   .v/.      \       \v         .v/.      \       \v        .v/.      \       \v.
     e        f<-----g            e        f<-----g           e        f<-----g
             ...                          ...                         ...

#+END_EXAMPLE

in (5) every _connected tree_ represents a _strongly connected component_ in the
original grapha

