UCB_CS61_lec28.html

<div id="org5f43c0e" class="outline-3">
<h3 id="org5f43c0e"><span class="section-number-3">10.4</span> Strongly connected</h3>
<div class="outline-text-3" id="text-10-4">
<p>
Strongly connected graph 是指图中任何一点都可以到达其他点的有向图。有很多算法都是建构在 stongly connected graph 的基础之上，所以识别这个属性非常重要
</p>

<pre class="example">
................         ..............
.   *-------&gt;*-.---------.&gt;*&lt;-------* .
.    ^      / \.         .  \      ^  .
.     \    /   .+--\     .   \    /   .
.      \  /    .    \    .    \  /    .
.       \v     .     v   .     v/     .
.        *     .      *--.----&gt;*      .
................      |  ..............
         |            |         |
         |            |         |
         |            |         |
         |            |         |
         |            |         |
         |            |         |
         |            |         |
 +---------------------------------------+
 |   3 strongly     connected components |
 +---------------------------------------+

</pre>
<p>
every directed graph can be split up into an equivalence class of strongly
connected components. These 3 are considered equivalence class of strongly
connected.
</p>

<p>
这对于你求有很多独立有向小图的大图的 minimum spanning tree 也很有作用，你首先就需要得到这么多小图这里‘独立’就是指是否 strongly connected，‘连接而不独立’ 就是指 connected but not strongly connected. 相当于连接性整体上升了一个档次。
</p>

<pre class="example" id="algo for identifing strongly connected graph">
1. DFS search and calculat finishing times of each node
   1. one for finishing times useful, algo for topological sort
   2. finishing times of a DFS give us in reverse the topological sort
2. reverse the edges in graph
3. call DFS on the nodes in the reverse graph, in reverse order of the finishing times

</pre>

<pre class="example">
Original graph:
          a-------&gt;b------&gt;c&lt;------d
           ^      / \       \      ^
            \    /   \       \    /
             \  /     \       \  /
              \v       v       v/
               e        f-----&gt;g

DFS and caculate finishing times:
                   6       3       1
        7 a-------&gt;b------&gt;c&lt;------d
           ^      / \       \      ^
            \    /   \       \    /
             \  /     \       \  /
              \v       v       v/
               e        f-----&gt;g
               4        5      2

Reverse edges:
          a&lt;-------b&lt;------c------&lt;d
           \      ^ ^       ^      /
            \    /   \       \    /
             \  /     \       \  /
              v/       \       \v
               e        f&lt;-----g

</pre>

<p>
Call DFS on nodes in reverse graph, in reverse order of finishing times
</p>
<pre class="example">
         (1)                         (2)
a&lt;-------b&lt;------c------&lt;d   a&lt;-------b&lt;------c------&lt;d
.\      ^ ^       ^      /   .\      ^.^       ^      /
 .\    /   \       \    /     .\    /.  \       \    /
  .\  /     \       \  /       .\  /.    \       \  /
   .v/       \       \v         .v/.      \       \v
     e        f&lt;-----g            e        f&lt;-----g

        (3)                          (4)                         (5)
                                               .......                     .......
a&lt;-------b&lt;------c------&lt;d   a&lt;-------b&lt;------c------&lt;d  a&lt;-------b&lt;------c------&lt;d
.\      ^.^       ^      /   .\      ^.^       ^      /  .\      ^.^       ^      /.
 .\    /.  \       \    /     .\    /.  \       \    /    .\    /.  \       \    /.
  .\  /.    \       \  /       .\  /.    \       \  /      .\  /.    \       \  /.
   .v/.      \       \v         .v/.      \       \v        .v/.      \       \v.
     e        f&lt;-----g            e        f&lt;-----g           e        f&lt;-----g
             ...                          ...                         ...

</pre>

<p>
in (5) every <span class="underline">connected tree</span> represents a <span class="underline">strongly connected component</span> in the
original grapha
</p>
</div>
</div>
</div>
