UCB_CS61_lec28.org
* Graph Traversals:DFS
We'll look at two types of graph traversals, which can be used on either
directed or undirected graphs to visit each vertex once.

Depth-first search (DFS) starts at an arbitrary vertex and searches a graph as
"deeply" as possible as early as possible. For example, if your graph is an
undirected tree, DFS performs a preorder (or if you prefer, postorder) tree
traversal.

Breadth-first search (BFS) starts by visiting an arbitrary vertex, then visits
all vertices whose distance from the starting vertex is one, then all vertices
whose distance from the starting vertex is two, and so on.  If your graph is an
undirected tree, BFS performs a level-order tree traversal.
有点像 level-order traversal

In a graph, unlike a tree, there may be several ways to get from one vertex to
another.

*如何处理多路径造成的 vertex 多次被访问的问题？*

Therefore, each vertex has a boolean field called "visited" that tells us if we
have visited the vertex before, so we don't visit it twice. When we say we are
"marking a vertex visited", we are setting its "visited" field to true.

Assume that we are traversing a strongly connected graph, thus there is a path
from the starting vertex to every other vertex.

When _DFS_ visits a vertex u, it checks every vertex v that can be _reached_ by
some edge (u, v).  If v has not yet been visited, DFS visits it _recursively_.

#+NAME: DFS
#+BEGIN_SRC java
public class Graph {
  // Before calling dfs(), set every "visited" flag to false; takes O(|V|) time
  public void dfs(Vertex u) {
    u.visit();                                // Do some unspecified thing to u
    u.visited = true;                              // Mark the vertex u visited
    for (each vertex v such that (u, v) is an edge in E) {       (ref:for-loop)
      if (!v.visited) {
        dfs(v);
      }
    }
  }
}
#+END_SRC
这里需要注意，‘遍历’ 和 ‘访问’ 是分开的，意思是说，当你‘遍历’的时候未必
‘访问’，而只有被标记为‘访问过（visited）’的节点，才不会被再次‘访问’，而最
终结果是输出所有‘访问过的节点及其路径’。‘遍历’ 就像一个游标一样只具有‘指’
的作用;而‘访问’才是真正的处理这个节点。

In this DFS pseudocode, a "visit()" method is defined that performs some action
on a specified vertex.

For instance, if we want to count the total population of the city graph above,
"visit()" might add the population of the visited city to the grand total. The
order in which cities are visited depends partly on their order in the adjacency
lists.

The sequence of figures below shows the behavior of DFS on our street map,
starting at vertex 1.
- A "~V~" is currently visited;
- an "~x~" is marked visited;
- a "~*~" is a vertex which we try to visit but discover has already been visited.

  #+BEGIN_EXAMPLE
V<-2<-3   x<-2<-3   x<-2<-3   x<-V<-3   *<-V<-3    x<-x<-3   x<-x<-V   x<-*<-V    x<-x<-V
|  ^  ^   |  ^  ^   |  ^  ^   |  ^  ^   |  ^  ^    |  ^  ^   |  ^  ^   |  ^  ^    |  ^  ^
v  |  v   v  |  v   v  |  v   v  |  v   v  |  v    v  |  v   v  |  v   v  |  v    v  |  v
4->5->6   V->5->6   x->V->6   x->x->6   x->x->6    x->x->V   x->x->x   x->x->x    x->x->*
| --  |   | --  |   | --  |   | --  |   | --   |   | --  |   | --  |   |      |   |   |
|     |   |     |   |     |   |     |   |      |   |     |   |     |   | u=2* |   |   |
|     |   |     |   |     |   |     |   | u=1* |   |     |   | u=3 |   | u=3* |   |   |
|     |   |     |   |     |   | u=2 |   | u=2* |   | u=6 |   | u=6 |   | u=6* |   |   |
|     |   |     |   | u=5 |   | u=5 |   | u=5  |   | u=5 |   | u=5 |   | u=5  |   |   |
|     |   | u=4 |   | u=4 |   | u=4 |   | u=4  |   | u=4 |   | u=4 |   | u=4  |   |   |
| u=1 |   | u=1 |   | u=1 |   | u=1 |   | u=1  |   | u=1 |   | u=1 |   | u=1  |   |   |

  #+END_EXAMPLE
DFS runs in:

O(|V| + |E|) (为什么还要加上 edge？因为每个 vertex 的每个 edge 都要检
测->[[(for-loop)]]) time if you use an adjacency list;

O(|V|^2) time if you use an adjacency matrix. Hence, an adjacency list is
asymptotically faster if the graph is sparse.

*What's an application of DFS?*

Suppose you want to determine _whether there is a path_ from a vertex u to
another vertex v. Just do DFS from u, and see if v gets visited. (If not, you
can't there from here.)

* How to specify 'Cycle path' in graph
  1. 通过设置 visited 可以 check 是否含有 cycle path，但是没法将这个 cycle path
     完整的打印出来
* More on the Running Time of DFS
Why does DFS on an adjacency list run in ~O(|V| + |E|)~ time?

The ~O(|V|)~ component comes up solely because we have to initialize all the
"visited" flags to false (or at least construct an array of flags) before we
start.

The ~O(|E|)~ component is trickier. Take a look at the "for" loop of the ~dfs()~
pseudocode above. How many times does it iterate? If the vertex u has outdegree
~d(u)~, then the loop iterates ~d(u)~ times. Different vertices have different
degrees. Let the total degree D be the sum of the outdegrees of all the vertices
in V.

#+BEGIN_EXAMPLE
  D =  sum  d(v).
     v in V
#+END_EXAMPLE

A call to ~dfs(u)~ takes ~O(d(u))~ time, NOT counting the time for the recursive
calls it makes to ~dfs()~. A depth-first search never calls ~dfs()~ more than
once on the same vertex, so the total running time of all the calls to ~dfs()~
is in ~O(D)~. How large is D?

- If G is a directed graph, then ~D = |E|~, the number of edges.
- If G is an undirected graph with no self-edges, then ~D = 2|E|~, because each
  edge offers a path out of two vertices.
- If G is an undirected graph with one or more self-edges, then ~D < 2|E|~.

In all three cases, the running time of depth-first search is in ~O(|E|)~, NOT
counting the time required to initialize the "visited" flags.
