UCB_CS61_lec28.html

<div id="org1ef39b6" class="outline-2">
<h2 id="org1ef39b6"><span class="section-number-2">11</span> Graph Traversals:DFS</h2>
<div class="outline-text-2" id="text-11">
<p>
We'll look at two types of graph traversals, which can be used on either
directed or undirected graphs to visit each vertex once.
</p>

<p>
Depth-first search (DFS) starts at an arbitrary vertex and searches a graph as
"deeply" as possible as early as possible. For example, if your graph is an
undirected tree, DFS performs a preorder (or if you prefer, postorder) tree
traversal.
</p>

<p>
Breadth-first search (BFS) starts by visiting an arbitrary vertex, then visits
all vertices whose distance from the starting vertex is one, then all vertices
whose distance from the starting vertex is two, and so on.  If your graph is an
undirected tree, BFS performs a level-order tree traversal.
有点像 level-order traversal
</p>

<p>
In a graph, unlike a tree, there may be several ways to get from one vertex to
another.
</p>

<p>
<b>如何处理多路径造成的 vertex 多次被访问的问题？</b>
</p>

<p>
Therefore, each vertex has a boolean field called "visited" that tells us if we
have visited the vertex before, so we don't visit it twice. When we say we are
"marking a vertex visited", we are setting its "visited" field to true.
</p>

<p>
Assume that we are traversing a strongly connected graph, thus there is a path
from the starting vertex to every other vertex.
</p>

<p>
When <span class="underline">DFS</span> visits a vertex u, it checks every vertex v that can be <span class="underline">reached</span> by
some edge (u, v).  If v has not yet been visited, DFS visits it <span class="underline">recursively</span>.
</p>

<div class="org-src-container">
<pre class="src src-java" id="org490908d"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Graph</span> {
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Before calling dfs(), set every "visited" flag to false; takes O(|V|) time</span>
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">dfs</span>(<span style="color: #ce537a; font-weight: bold;">Vertex</span> <span style="color: #7590db;">u</span>) {
    u.visit();                                <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Do some unspecified thing to u</span>
    u.visited = <span style="color: #a45bad;">true</span>;                              <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Mark the vertex u visited</span>
<span id="coderef-for-loop" class="coderef-off">    <span style="color: #4f97d7; font-weight: bold;">for</span> (each vertex v <span style="color: #ce537a; font-weight: bold;">such</span> <span style="color: #bc6ec5; font-weight: bold;">that</span> (<span style="color: #ce537a; font-weight: bold;">u</span>, <span style="color: #ce537a; font-weight: bold;">v</span>) is an edge in E) { (for-loop)</span>
      <span style="color: #4f97d7; font-weight: bold;">if</span> (<span style="color: #a45bad;">!</span>v.visited) {
        dfs(v);
      }
    }
  }
}
</pre>
</div>
<p>
这里需要注意，‘遍历’ 和 ‘访问’ 是分开的，意思是说，当你‘遍历’的时候未必‘访问’，而只有被标记为‘访问过（visited）’的节点，才不会被再次‘访问’，而最终结果是输出所有‘访问过的节点及其路径’。‘遍历’ 就像一个游标一样只具有‘指’的作用;而‘访问’才是真正的处理这个节点。
</p>

<p>
In this DFS pseudocode, a "visit()" method is defined that performs some action
on a specified vertex.
</p>

<p>
For instance, if we want to count the total population of the city graph above,
"visit()" might add the population of the visited city to the grand total. The
order in which cities are visited depends partly on their order in the adjacency
lists.
</p>

<p>
The sequence of figures below shows the behavior of DFS on our street map,
starting at vertex 1.
</p>
<ul class="org-ul">
<li>A "<code>V</code>" is currently visited;</li>
<li>an "<code>x</code>" is marked visited;</li>
<li><p>
a "<code>*</code>" is a vertex which we try to visit but discover has already been visited.
</p>

<pre class="example">
V&lt;-2&lt;-3   x&lt;-2&lt;-3   x&lt;-2&lt;-3   x&lt;-V&lt;-3   *&lt;-V&lt;-3    x&lt;-x&lt;-3   x&lt;-x&lt;-V   x&lt;-*&lt;-V    x&lt;-x&lt;-V
|  ^  ^   |  ^  ^   |  ^  ^   |  ^  ^   |  ^  ^    |  ^  ^   |  ^  ^   |  ^  ^    |  ^  ^
v  |  v   v  |  v   v  |  v   v  |  v   v  |  v    v  |  v   v  |  v   v  |  v    v  |  v
4-&gt;5-&gt;6   V-&gt;5-&gt;6   x-&gt;V-&gt;6   x-&gt;x-&gt;6   x-&gt;x-&gt;6    x-&gt;x-&gt;V   x-&gt;x-&gt;x   x-&gt;x-&gt;x    x-&gt;x-&gt;*
| --  |   | --  |   | --  |   | --  |   | --   |   | --  |   | --  |   |      |   |   |
|     |   |     |   |     |   |     |   |      |   |     |   |     |   | u=2* |   |   |
|     |   |     |   |     |   |     |   | u=1* |   |     |   | u=3 |   | u=3* |   |   |
|     |   |     |   |     |   | u=2 |   | u=2* |   | u=6 |   | u=6 |   | u=6* |   |   |
|     |   |     |   | u=5 |   | u=5 |   | u=5  |   | u=5 |   | u=5 |   | u=5  |   |   |
|     |   | u=4 |   | u=4 |   | u=4 |   | u=4  |   | u=4 |   | u=4 |   | u=4  |   |   |
| u=1 |   | u=1 |   | u=1 |   | u=1 |   | u=1  |   | u=1 |   | u=1 |   | u=1  |   |   |

</pre></li>
</ul>
<p>
DFS runs in:
</p>

<p>
O(|V| + |E|) (为什么还要加上 edge？因为每个 vertex 的每个 edge 都要检测-&gt;<a href="#coderef-for-loop" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-for-loop');" onmouseout="CodeHighlightOff(this, 'coderef-for-loop');">for-loop</a>) time if you use an adjacency list;
</p>

<p>
O(|V|^2) time if you use an adjacency matrix. Hence, an adjacency list is
asymptotically faster if the graph is sparse.
</p>

<p>
<b>What's an application of DFS?</b>
</p>

<p>
Suppose you want to determine <span class="underline">whether there is a path</span> from a vertex u to
another vertex v. Just do DFS from u, and see if v gets visited. (If not, you
can't there from here.)
</p>
</div>
</div>

<div id="orgc743b05" class="outline-2">
<h2 id="orgc743b05"><span class="section-number-2">12</span> How to specify 'Cycle path' in graph</h2>
<div class="outline-text-2" id="text-12">
<ol class="org-ol">
<li>通过设置 visited 可以 check 是否含有 cycle path，但是没法将这个 cycle path
完整的打印出来</li>
</ol>
</div>
</div>
<div id="org2b2919f" class="outline-2">
<h2 id="org2b2919f"><span class="section-number-2">13</span> More on the Running Time of DFS</h2>
<div class="outline-text-2" id="text-13">
<p>
Why does DFS on an adjacency list run in <code>O(|V| + |E|)</code> time?
</p>

<p>
The <code>O(|V|)</code> component comes up solely because we have to initialize all the
"visited" flags to false (or at least construct an array of flags) before we
start.
</p>

<p>
The <code>O(|E|)</code> component is trickier. Take a look at the "for" loop of the <code>dfs()</code>
pseudocode above. How many times does it iterate? If the vertex u has outdegree
<code>d(u)</code>, then the loop iterates <code>d(u)</code> times. Different vertices have different
degrees. Let the total degree D be the sum of the outdegrees of all the vertices
in V.
</p>

<pre class="example">
D =  sum  d(v).
   v in V
</pre>

<p>
A call to <code>dfs(u)</code> takes <code>O(d(u))</code> time, NOT counting the time for the recursive
calls it makes to <code>dfs()</code>. A depth-first search never calls <code>dfs()</code> more than
once on the same vertex, so the total running time of all the calls to <code>dfs()</code>
is in <code>O(D)</code>. How large is D?
</p>

<ul class="org-ul">
<li>If G is a directed graph, then <code>D = |E|</code>, the number of edges.</li>
<li>If G is an undirected graph with no self-edges, then <code>D = 2|E|</code>, because each
edge offers a path out of two vertices.</li>
<li>If G is an undirected graph with one or more self-edges, then <code>D &lt; 2|E|</code>.</li>
</ul>

<p>
In all three cases, the running time of depth-first search is in <code>O(|E|)</code>, NOT
counting the time required to initialize the "visited" flags.
</p>
</div>
</div>
</div>
</body>
</html>
